hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_cmp.c
/**
 *******************************************************************************
 * @file  hc32m120_cmp.c
 * @brief This file provides firmware functions to manage the Comparator(CMP).
 *
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-06-25       Wangmin         First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m120_cmp.h"
#include "hc32m120_utility.h"

/**
 * @addtogroup HC32M120_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_CMP CMP
 * @brief CMP Driver Library
 * @{
 */

#if (DDL_CMP_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CMP_Local_Macros CMP Local Macros
 * @{
 */


/**
 * @defgroup CMP_Check_Parameters_Validity CMP Check Parameters Validity
 * @{
 */

#define IS_CMP_INSTANCE(x)                                                     \
(   (M0P_CMP1 == (x))                             ||                             \
    (M0P_CMP2 == (x)))

#define IS_CMP_MODE(x)                                                         \
(   (CMP_MODE_NORMAL == (x))                    ||                             \
    (CMP_MODE_WINDOW == (x)))

#define IS_CMP1_CVSL(x)                                                        \
(   (CMP1_CVSL_NONE == (x))                     ||                             \
    (CMP1_CVSL_VCMP1_0 == (x))                  ||                             \
    (CMP1_CVSL_VCMP1_1 == (x))                  ||                             \
    (CMP1_CVSL_VCMP2_0 == (x)))

#define IS_CMP2_CVSL(x)                                                        \
(   (CMP2_CVSL_NONE == (x))                     ||                             \
    (CMP2_CVSL_VCMP2_0 == (x))                  ||                             \
    (CMP2_CVSL_VCMP2_1 == (x))                  ||                             \
    (CMP2_CVSL_VCMP2_2 == (x)))

#define IS_CMP1_RVSL(x)                                                        \
(   (CMP1_RVSL_NONE == (x))                     ||                             \
    (CMP1_RVSL_IVREF1 == (x))                   ||                             \
    (CMP1_RVSL_VREF == (x)))

#define IS_CMP2_RVSL(x)                                                        \
(   (CMP2_RVSL_NONE == (x))                     ||                             \
    (CMP2_RVSL_IVREF2 == (x))                   ||                             \
    (CMP2_RVSL_VREF == (x))                     ||                             \
    (CMP2_RVSL_IVCMP2_2 == (x)))

#define IS_CMP_OUT_POLARITY(x)                                                 \
(   (CMP_OUT_REVERSE_OFF == (x))                ||                             \
    (CMP_OUT_REVERSE_ON == (x)))

#define IS_CMP_OUT_DETECT_EDGE(x)                                              \
(   (CMP_DETECT_EDGS_NONE == (x))               ||                             \
    (CMP_DETECT_EDGS_RISING == (x))             ||                             \
    (CMP_DETECT_EDGS_FALLING == (x))            ||                             \
    (CMP_DETECT_EDGS_BOTH == (x)))

#define IS_CMP_OUT_FILTER(x)                                                   \
(   (CMP_OUT_FILTER_NONE == (x))                ||                             \
    (CMP_OUT_FILTER_PCLK == (x))                ||                             \
    (CMP_OUT_FILTER_PCLKDIV8 == (x))            ||                             \
    (CMP_OUT_FILTER_PCLKDIV32 == (x)))

