hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_cmp.c
        /* Start CMP compare */
        WRITE_REG(CMPx->MDR, CMP_MDR_CENB);
        /* Delay 300ns*/
        CMP_Delay300ns();

        /* Set output filter and output detect edge and output polarity */
        WRITE_REG(CMPx->FIR,
                  pstcCMP_InitStruct->u8OutFilter | pstcCMP_InitStruct->u8OutDetectEdges);
        WRITE_REG(CMPx->OCR, pstcCMP_InitStruct->u8OutPolarity);
    }
    return enRet;
}

/**
 * @brief  CMP window mode initialize
 * @param  [in] pstcCMP_InitStruct Configuration structure for window mode initialize
 *              pstcCMP_InitStruct->u8WinVolLow
 *                                CMP reference low voltage for window mode,
 *                                @ref CMP1_RVSL_Source
 *              pstcCMP_InitStruct->u8WinVolHigh
 *                                CMP reference high voltage for window mode,
 *                                @ref CMP2_RVSL_Source
 *              pstcCMP_InitStruct->u8OutPolarity
 *                                Output polarity select, @ref CMP_Out_Polarity_Select
 *              pstcCMP_InitStruct->u8OutDetectEdges
 *                                Output detect edge, @ref CMP_Out_Detect_Edge
 *              pstcCMP_InitStruct->u8OutFilter
 *                                Output Filter, @ref CMP_Out_Filter
 *
 * @retval An en_result_t enumeration value:
 *              - Ok:             Successfully
 *              - ErrorInvalidParameter: CMPx or pointer of structure is invalid
 */
en_result_t CMP_WindowModeInit(const stc_cmp_init_t* pstcCMP_InitStruct)
{
    en_result_t enRet = Ok;
    /* Check configuration structure */
    if (NULL == pstcCMP_InitStruct)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_CMP_OUT_DETECT_EDGE(pstcCMP_InitStruct->u8OutDetectEdges));
        DDL_ASSERT(IS_CMP_OUT_FILTER(pstcCMP_InitStruct->u8OutFilter));
        DDL_ASSERT(IS_CMP_OUT_POLARITY(pstcCMP_InitStruct->u8OutPolarity));
        DDL_ASSERT(IS_CMP1_RVSL(pstcCMP_InitStruct->u8WinVolLow));
        DDL_ASSERT(IS_CMP2_RVSL(pstcCMP_InitStruct->u8WinVolHigh));

        /* Stop CMP compare */
        WRITE_REG(M0P_CMP1->MDR, 0x00u);
        WRITE_REG(M0P_CMP2->MDR, 0x00u);

        /* Set compare voltage and reference voltage */
        WRITE_REG(M0P_CMP1->VSR,
                  CMP1_CVSL_VCMP2_0 | pstcCMP_InitStruct->u8WinVolLow);
        WRITE_REG(M0P_CMP2->VSR,
                  CMP2_CVSL_VCMP2_0 | pstcCMP_InitStruct->u8WinVolHigh);

        /* Select window compare mode and start CMP compare function */
        WRITE_REG(M0P_CMP2->MDR, CMP_MDR_CENB | CMP_MDR_CWDE);
        WRITE_REG(M0P_CMP1->MDR, CMP_MDR_CENB);
        /* Delay 300ns*/
        CMP_Delay300ns();

        /* Set output filter and output detect edge and output polarity */
        WRITE_REG(M0P_CMP2->FIR,
                  pstcCMP_InitStruct->u8OutFilter | pstcCMP_InitStruct->u8OutDetectEdges);
        WRITE_REG(M0P_CMP2->OCR, pstcCMP_InitStruct->u8OutPolarity);
    }
    return enRet;
}

/**
 * @brief  De-initialize CMP unit
 * @param  [in] CMPx              Pointer to CMP instance register base,This
 *                                parameter can be one of the following values:
 *              @arg M0P_CMP1:   CMP unit 1 instance register base
 *              @arg M0P_CMP2:   CMP unit 2 instance register base
 * @retval An en_result_t enumeration value:
 *              - Ok:             Successfully
 *              - ErrorInvalidParameter: CMPx or pointer of structure is invalid
 */
en_result_t CMP_DeInit(M0P_CMP_TypeDef *CMPx)
{
    en_result_t enRet = Ok;
    /* Check CMPx instance */
    if (!IS_CMP_INSTANCE(CMPx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        CMPx->MDR = 0x00u;
        CMPx->FIR = 0x00u;
        CMPx->OCR = 0x00u;
        CMPx->VSR = 0x00u;
        CMPx->TWR1 = 0x00u;
        CMPx->TWR2 = 0x00u;
    }
    return enRet;
}

/**
 * @brief  Initialize structure stc_cmp_init_t variable with default value.
 * @param  [out] pstcCMP_InitStruct     Pointer to a stc_cmp_init_t structure variable
 *                                      which will be initialized.
 *   @arg  See the struct @ref stc_cmp_init_t.
 * @retval en_result_t
 */
en_result_t CMP_StructInit(stc_cmp_init_t* pstcCMP_InitStruct)
{
    en_result_t enRet = Ok;
    if (pstcCMP_InitStruct == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcCMP_InitStruct->u8CmpVol = CMP1_CVSL_NONE;
        pstcCMP_InitStruct->u8RefVol = CMP1_RVSL_NONE;
        pstcCMP_InitStruct->u8OutDetectEdges = (uint8_t)CMP_DETECT_EDGS_NONE;
        pstcCMP_InitStruct->u8OutFilter = CMP_OUT_FILTER_NONE;
        pstcCMP_InitStruct->u8OutPolarity = CMP_OUT_REVERSE_OFF;
        pstcCMP_InitStruct->u8WinVolLow = CMP1_RVSL_NONE;
        pstcCMP_InitStruct->u8WinVolHigh = CMP2_RVSL_NONE;
    }
    return enRet;
}

/**
 * @}
 */

/**
 * @brief  Software delay 300ns.
 * @param  None
 *
 * @retval None
 */
static void CMP_Delay300ns(void)
{
    for(uint32_t i=0ul; i<(SystemCoreClock/3333333ul + 1ul); i++)
    {
        __NOP();
    }
}

#endif /* DDL_CMP_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
